// Auteur: Yves Chiricota 11/11/2000
#include "stdafx.h"

#include "MMU.h"




// --------------------------------------------------------------------------------
//  Classe:	MMU
//
//  Par:   Yves Chiricota
//  Date:  12/11/00
//  MAJ:
// --------------------------------------------------------------------------------


// --------------------------------------------------------------------------------
//  Fonction: MMU
//
//  Par:   Yves Chiricota
//  Date:  12/11/00
//  MAJ:
// --------------------------------------------------------------------------------
MMU::MMU(RAM* _ram, MemSecondaire* _memsec) :
	ram(_ram),
	memsec(_memsec)
{
}



// --------------------------------------------------------------------------------
//  Fonction: virtalloc
//
//  Par:   Yves Chiricota
//  Date:  12/11/00
//  MAJ:
// --------------------------------------------------------------------------------
bool	MMU::virtalloc(int nb_pages)
{
    maxAdress = nb_pages * 64;
	return true;
}


// --------------------------------------------------------------------------------
//  Fonction: read
//
//  Par:   Yves Chiricota
//  Date:  12/11/00
//  MAJ:
// --------------------------------------------------------------------------------
byte	MMU::read(adresse a) const
{
    cout << "Dans read" << endl;
    cout << "  adresse: " << a << endl;
	return 0;
}


// --------------------------------------------------------------------------------
//  Fonction: write
//
//  Par:   Yves Chiricota
//  Date:  12/11/00
//  MAJ:
// --------------------------------------------------------------------------------
bool	MMU::write(byte b, adresse a)
{
    cout << "Dans write" << endl;
    cout << "  adresse: " << a << endl;
    cout << "  valeur: " << b << endl;
	return false;
}



// --------------------------------------------------------------------------------
//  Fonction: load
//  Fonction d'échange de pages
//
//  Par:   Yves Chiricota
//  Date:  12/11/00
//  MAJ:
// --------------------------------------------------------------------------------
void	MMU::load(int page, int frame)
{
}


// --------------------------------------------------------------------------------
//  Fonction: store
//
//  Par:   Yves Chiricota
//  Date:  12/11/00
//  MAJ:
// --------------------------------------------------------------------------------
void	MMU::store(int page, int frame)
{
}




